"""
算術運算子(arithmentic operator):+、-、*、/、//、%、**
移位運算子(shifting operator):<<、>>
位元運算子(bitwise operator):~、&、|、^
比較運算子(comparison operator):>、<、>=、<=、==、!=
邏輯運算子(logical operator):and、or、not
指派運算子(assignment operator):=、+=、-=、*=、/=、//=、%=、**=、<<=、>>=、&=、|=、^=
其它特殊符號:()、[]、{}、，、:、.、;
------------------------------------------------------------------
單位運算子(unary operator):
例:+,~,-
此時+or-並非加法和減法運算子
而是用來表示正負數
採前置記法(prefix notation) 例:+5,-5
------------------------------------------------------------------
二元運算子(binary operator):+,-,~以外的運算子屬二元運算子，有兩個運算元
採中置記法(infix notation)
例:1.23*1000,1200/50
------------------------------------------------------------------
//(整數除法)
%(餘數)
**(指數)
-------------------
移位運算子
<<(向左位移)
例:1<<3 = 8
000001 變 001000
>>(向右位移)
例:8>>2 = 2
01000 變 00010
a<<b 相當於 a*2^b
a>>b 相當於 a/2^b
-------------------

"""
